Revit 2027 API
PlanViewPlane Enumeration
 Locations where view range offsets can be specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlanViewPlane
Public Enumeration PlanViewPlane
public enum class PlanViewPlane
type PlanViewPlane
Members
Member name | Value | Description
BottomClipPlane | 2 |  Bottom Clip Plane
CutPlane | 0 |  Cut Plane
TopClipPlane | 1 |  Top Clip Plane
UnderlayBottom | 4 |  Underlay Bottom Plane
ViewDepthPlane | 3 |  View Depth Plane
See Also
Reference
Autodesk.Revit.DB Namespace